In [1]:
import pandas as pd

### Operation on a new column

In [2]:
data = {
  "EmpName": ["A", "B", "C"],
  "Salary": [10000, 25000, 30000],
  "Location": ["Pune", "Mumbai","Delhi"]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  EmpName  Salary Location
0       A   10000     Pune
1       B   25000   Mumbai
2       C   30000    Delhi

In [5]:
df['Flag'] = df.apply(lambda row: row.Salary + (0.1*row.Salary), axis=1)
df

  EmpName  Salary Location     Flag
0       A   10000     Pune  11000.0
1       B   25000   Mumbai  27500.0
2       C   30000    Delhi  33000.0

### Concat() function

In [6]:
df1 = pd.DataFrame({'id': [1,2,3]}, index = ['r1','r2','r3'])
df1

    id
r1   1
r2   2
r3   3

In [7]:
df2 = pd.DataFrame({'id': [10,20,30]}, index = ['r1','r2','r3'])
df2

    id
r1  10
r2  20
r3  30

In [8]:
df3 = pd.concat([df1,df2], axis=1)

In [9]:
df3

    id  id
r1   1  10
r2   2  20
r3   3  30

### Simply Sum in another row

In [10]:
df3['Sum'] = df1+df2

In [11]:
df3

    id  id  Sum
r1   1  10   11
r2   2  20   22
r3   3  30   33

### Append () function

In [12]:
# It will simply append the rows in a dataFrame one below the other.

In [13]:
df3 = df1.append(df2)

In [14]:
df3

    id
r1   1
r2   2
r3   3
r1  10
r2  20
r3  30

#### Basic df structure

In [15]:
df = pd.DataFrame([100,200,300,400,500], index=range(5), columns=["Num"])

In [16]:
df

   Num
0  100
1  200
2  300
3  400
4  500

### More Concat() func

In [17]:
import pandas as pd

df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

df3 = pd.DataFrame({'City': ['MUMBAI', 'PUNE', 'MUMBAI', 'DELHI'],
					'Age': ['12', '13', '14', '12']})

# the default behaviour is join='outer'

# Along row axis & inner join 
result = pd.concat([df1, df3], axis=1, join='inner')
display(result)
# no change here in outer and inner

    id Name    City Age
0  A01  ABC  MUMBAI  12
1  A02  PQR    PUNE  13
2  A03  DEF  MUMBAI  14
3  A04  GHI   DELHI  12

In [18]:
# Along column axis & default outer join 
result = pd.concat([df1, df3], axis=0, join='outer')
display(result)

    id Name    City  Age
0  A01  ABC     NaN  NaN
1  A02  PQR     NaN  NaN
2  A03  DEF     NaN  NaN
3  A04  GHI     NaN  NaN
0  NaN  NaN  MUMBAI   12
1  NaN  NaN    PUNE   13
2  NaN  NaN  MUMBAI   14
3  NaN  NaN   DELHI   12

### Concatenating using append

In [19]:
import pandas as pd
# First DataFrame
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

# Second DataFrame
df2 = pd.DataFrame({'id': ['B05', 'B06', 'B07', 'B08'],
					'Name': ['XYZ', 'TUV', 'MNO', 'JKL']})

df3 = pd.DataFrame({'City': ['MUMBAI', 'PUNE', 'MUMBAI', 'DELHI'],
					'Age': ['12', '13', '14', '12']})


# appending multiple DataFrame
result = df1.append([df2, df3])
display(result)

    id Name    City  Age
0  A01  ABC     NaN  NaN
1  A02  PQR     NaN  NaN
2  A03  DEF     NaN  NaN
3  A04  GHI     NaN  NaN
0  B05  XYZ     NaN  NaN
1  B06  TUV     NaN  NaN
2  B07  MNO     NaN  NaN
3  B08  JKL     NaN  NaN
0  NaN  NaN  MUMBAI   12
1  NaN  NaN    PUNE   13
2  NaN  NaN  MUMBAI   14
3  NaN  NaN   DELHI   12

### Join() function

In [37]:
left = pd.DataFrame({"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=[0,1,2])

In [38]:
right = pd.DataFrame({"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=[0,2,3])

In [39]:
# common columns
result = left.join(right)
result

    A   B    C    D
0  A0  B0   C0   D0
1  A1  B1  NaN  NaN
2  A2  B2   C2   D2

In [40]:
# inner
result = left.join(right, how='inner')
result

    A   B   C   D
0  A0  B0  C0  D0
2  A2  B2  C2  D2

In [41]:
# outer
result = left.join(right, how='outer')
result

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1  NaN  NaN
2   A2   B2   C2   D2
3  NaN  NaN   C3   D3

In [43]:
# left
result = left.join(right, how='left')
result

    A   B    C    D
0  A0  B0   C0   D0
1  A1  B1  NaN  NaN
2  A2  B2   C2   D2

In [44]:
# right
result = left.join(right, how='right')
result

     A    B   C   D
0   A0   B0  C0  D0
2   A2   B2  C2  D2
3  NaN  NaN  C3  D3